#### Terraform Format and Style ✨`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_network.vpc_network: Refreshing state... [id=projects/metaphor-app/global/networks/ceramic]
google_compute_disk.ceramic-disk: Refreshing state... [id=projects/metaphor-app/zones/us-east4-b/disks/ceramic-data-0]
google_compute_disk.ipfs-disk: Refreshing state... [id=projects/metaphor-app/zones/us-east4-b/disks/ipfs-data-0]
google_compute_firewall.ipfs-firewall: Refreshing state... [id=projects/metaphor-app/global/firewalls/ipfs-daemon-http]
google_compute_firewall.ceramic-firewall: Refreshing state... [id=projects/metaphor-app/global/firewalls/ceramic-daemon-http]
google_compute_instance.ipfs-instance: Refreshing state... [id=projects/metaphor-app/zones/us-east4-b/instances/ipfs-daemon]
google_compute_instance.ceramic-instance: Refreshing state... [id=projects/metaphor-app/zones/us-east4-b/instances/ceramic-daemon]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_disk.ceramic-disk has changed
  ~ resource "google_compute_disk" "ceramic-disk" {
        id                        = "projects/metaphor-app/zones/us-east4-b/disks/ceramic-data-0"
      ~ last_attach_timestamp     = "2022-01-11T12:57:22.535-08:00" -> "2022-01-11T14:14:00.627-08:00"
      + last_detach_timestamp     = "2022-01-11T14:11:46.362-08:00"
        name                      = "ceramic-data-0"
        # (11 unchanged attributes hidden)
    }

  # google_compute_disk.ipfs-disk has changed
  ~ resource "google_compute_disk" "ipfs-disk" {
        id                        = "projects/metaphor-app/zones/us-east4-b/disks/ipfs-data-0"
      ~ last_attach_timestamp     = "2022-01-11T12:57:09.836-08:00" -> "2022-01-11T14:13:48.170-08:00"
      + last_detach_timestamp     = "2022-01-11T14:13:38.554-08:00"
        name                      = "ipfs-data-0"
        # (11 unchanged attributes hidden)
    }

  # google_compute_instance.ceramic-instance has changed
  ~ resource "google_compute_instance" "ceramic-instance" {
        id                   = "projects/metaphor-app/zones/us-east4-b/instances/ceramic-daemon"
        name                 = "ceramic-daemon"
      + resource_policies    = []
        tags                 = [
            "ceramic-daemon",
        ]
        # (16 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # google_compute_instance.ipfs-instance has changed
  ~ resource "google_compute_instance" "ipfs-instance" {
        id                   = "projects/metaphor-app/zones/us-east4-b/instances/ipfs-daemon"
        name                 = "ipfs-daemon"
      + resource_policies    = []
        tags                 = [
            "ipfs-daemon",
        ]
        # (16 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.ceramic-instance must be replaced
-/+ resource "google_compute_instance" "ceramic-instance" {
      ~ cpu_platform         = "Intel Broadwell" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/metaphor-app/zones/us-east4-b/instances/ceramic-daemon" -> (known after apply)
      ~ instance_id          = "5781690556802645959" -> (known after apply)
      ~ label_fingerprint    = "KFSVyJCKeYg=" -> (known after apply)
      ~ labels               = {
          ~ "container-vm" = "cos-stable-93-16623-39-30" -> "cos-stable-93-16623-39-40"
        }
      ~ metadata             = {
          - "gce-container-declaration" = <<-EOT
                "spec":
                  "containers":
                  - "args":
                    - "--hostname"
                    - "0.0.0.0"
                    - "--network"
                    - "testnet-clay"
                    - "--ipfs-api"
                    - "http://10.150.0.4:5001"
                    - "--state-store-directory"
                    - "/data"
                    "image": "ceramicnetwork/js-ceramic:prod"
                    "ports":
                    - "containerPort": 7007
                    - "containerPort": 9229
                    "volumeMounts":
                    - "mountPath": "/data"
                      "name": "ceramic-data-0"
                      "readOnly": false
                  "restartPolicy": "Always"
                  "volumes":
                  - "gcePersistentDisk":
                      "fsType": "ext4"
                      "pdName": "ceramic-data-0"
                    "name": "ceramic-data-0"
            EOT
        } -> (known after apply)
      ~ metadata_fingerprint = "xYD3Q3WdilQ=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "ceramic-daemon"
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/metaphor-app/zones/us-east4-b/instances/ceramic-daemon" -> (known after apply)
        tags                 = [
            "ceramic-daemon",
        ]
      ~ tags_fingerprint     = "5BOSi7Y2Ad4=" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ attached_disk {
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/metaphor-app/zones/us-east4-b/disks/ceramic-daemon" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/cos-cloud/global/images/cos-stable-93-16623-39-30" -> "https://www.googleapis.com/compute/v1/projects/cos-cloud/global/images/cos-stable-93-16623-39-40" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/metaphor-app/global/networks/ceramic" -> "projects/metaphor-app/global/networks/ceramic"
          ~ network_ip         = "10.150.0.5" -> (known after apply)
          - queue_count        = 0 -> null
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/metaphor-app/regions/us-east4/subnetworks/ceramic" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ access_config {
              ~ nat_ip       = "34.150.218.204" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

  # google_compute_instance.ipfs-instance must be replaced
-/+ resource "google_compute_instance" "ipfs-instance" {
      ~ cpu_platform         = "Intel Broadwell" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/metaphor-app/zones/us-east4-b/instances/ipfs-daemon" -> (known after apply)
      ~ instance_id          = "8429605149679534068" -> (known after apply)
      ~ label_fingerprint    = "KFSVyJCKeYg=" -> (known after apply)
      ~ labels               = {
          ~ "container-vm" = "cos-stable-93-16623-39-30" -> "cos-stable-93-16623-39-40"
        }
      ~ metadata_fingerprint = "FKA9hLX7gRg=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "ipfs-daemon"
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/metaphor-app/zones/us-east4-b/instances/ipfs-daemon" -> (known after apply)
        tags                 = [
            "ipfs-daemon",
        ]
      ~ tags_fingerprint     = "MzS_uAeAMWU=" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ attached_disk {
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/metaphor-app/zones/us-east4-b/disks/ipfs-daemon" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/cos-cloud/global/images/cos-stable-93-16623-39-30" -> "https://www.googleapis.com/compute/v1/projects/cos-cloud/global/images/cos-stable-93-16623-39-40" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/metaphor-app/global/networks/ceramic" -> "projects/metaphor-app/global/networks/ceramic"
          ~ network_ip         = "10.150.0.4" -> (known after apply)
          - queue_count        = 0 -> null
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/metaphor-app/regions/us-east4/subnetworks/ceramic" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ access_config {
              ~ nat_ip       = "34.86.218.46" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @carlosdp, Action: `pull_request`, Working Directory: ``, Workflow: `plan`*